DDDSZY/S32K1X_MCAL_DEMO/S32K148_MCAL_DEMO/MCAL/Mcu_TS_T40D2M10I6R0/include/Reg_eSys_SIM.h
/**
*   @file    Reg_eSys_SIM.h
*   @version 1.0.6
*
*   @brief   AUTOSAR Mcu - Macros for memory access.
*   @details Macros/Defines used for registry and memory read/write.
*
*   @addtogroup MCU
*   @{
*/
/*==================================================================================================
*   Project              : AUTOSAR 4.2 MCAL
*   Platform             : ARM
*   Peripheral           : MC
*   Dependencies         : none
*
*   Autosar Version      : 4.2.2
*   Autosar Revision     : ASR_REL_4_2_REV_0002
*   Autosar Conf.Variant :
*   SW Version           : 1.0.6
*   Build Version        : S32K1XX_MCAL_1_0_6_RTM_ASR_REL_4_2_REV_0002_07-Jun-23
*
*   (c) Copyright 2006-2016 Freescale Semiconductor, Inc. 
*   Copyright 2017-2023 NXP
*
*   NXP Confidential. This software is owned or controlled by NXP and may only be 
*   used strictly in accordance with the applicable license terms.  By expressly 
*   accepting such terms or by downloading, installing, activating and/or otherwise 
*   using the software, you are agreeing that you have read, and that you agree to 
*   comply with and are bound by, such license terms.  If you do not agree to be 
*   bound by the applicable license terms, then you may not retain, install,
*   activate or otherwise use the software.
==================================================================================================*/
/*==================================================================================================
==================================================================================================*/


#ifndef REG_ESYS_SIM_H
#define REG_ESYS_SIM_H


#ifdef __cplusplus
extern "C"{
#endif


/**
* @page misra_violations MISRA-C:2004 violations
*
* @section Reg_eSys_SIM_h_REF_1
* Violates MISRA 2004 Required Rule 1.4, : The compiler/linker shall be checked to ensure that 31
* character significance and case sensitivity are supported for external identifiers
*
* @section Reg_eSys_SIM_h_REF_2
* Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined
* This violation is due to function like macros defined for register operations.
* Function like macros are used to reduce code complexity.
*
* @section [global]
* Violates MISRA 2004 Required Rule 5.1, Identifiers (internal and external) shall not rely
* on the significance of more than 31 characters. The used compilers use more than 31 chars for
* identifiers.
*/


/*==================================================================================================
                                         INCLUDE FILES
 1) system and project includes
 2) needed interfaces from external units
 3) internal and external interfaces from this unit
==================================================================================================*/
#include "Reg_eSys.h"

/*==================================================================================================
                               SOURCE FILE VERSION INFORMATION
==================================================================================================*/

#define REG_ESYS_SIM_VENDOR_ID                       43
/** @violates @ref Reg_eSys_SIM_h_REF_1 The compiler/linker shall be checked. */
#define REG_ESYS_SIM_AR_RELEASE_MAJOR_VERSION        4
/** @violates @ref Reg_eSys_SIM_h_REF_1 The compiler/linker shall be checked. */
#define REG_ESYS_SIM_AR_RELEASE_MINOR_VERSION        2
/** @violates @ref Reg_eSys_SIM_h_REF_1 The compiler/linker shall be checked. */
#define REG_ESYS_SIM_AR_RELEASE_REVISION_VERSION     2
#define REG_ESYS_SIM_SW_MAJOR_VERSION                1
#define REG_ESYS_SIM_SW_MINOR_VERSION                0
#define REG_ESYS_SIM_SW_PATCH_VERSION                6


/*==================================================================================================
                                      FILE VERSION CHECKS
==================================================================================================*/
/* Check if current file and Reg_eSys header file are of the same version */
#ifndef DISABLE_MCAL_INTERMODULE_ASR_CHECK
    #if ((REG_ESYS_SIM_AR_RELEASE_MAJOR_VERSION != REG_ESYS_AR_RELEASE_MAJOR_VERSION) || \
         (REG_ESYS_SIM_AR_RELEASE_MINOR_VERSION != REG_ESYS_AR_RELEASE_MINOR_VERSION) \
        )
        #error "AutoSar Version Numbers of Reg_eSys_SIM.h and Reg_eSys.h are different"
    #endif
#endif

/*==================================================================================================
*                                          CONSTANTS
==================================================================================================*/


/*==================================================================================================
                                       DEFINES AND MACROS
==================================================================================================*/
/********** SIM Registers **********/

/* SIM_CHIPCTL - Chip Control register */
#define SIM_CHIPCTL_ADDR32                  ((uint32)(SIM_BASEADDR + (uint32)0x00000004U))
/* SIM_FTMOPT0 - FTM Option Register 0 */
#define SIM_FTMOPT0_ADDR32                  ((uint32)(SIM_BASEADDR + (uint32)0x0000000CU))
/* SIM_LPOCLKS - LPO Clock Select Register */
#define SIM_LPOCLKS_ADDR32                  ((uint32)(SIM_BASEADDR + (uint32)0x00000010U))
/* SIM_ADCOPT - ADC Options Register */
#define SIM_ADCOPT_ADDR32                   ((uint32)(SIM_BASEADDR + (uint32)0x00000018U))
/* SIM_FTMOPT1 - FTM Option Register 1 */
#define SIM_FTMOPT1_ADDR32                  ((uint32)(SIM_BASEADDR + (uint32)0x0000001CU))
/* SIM_MISCTRL0 - Miscellaneous control register 0 */
#define SIM_MISCTRL0_ADDR32                 ((uint32)(SIM_BASEADDR + (uint32)0x00000020U))
/* SIM_SDID - System Device Identification Register */
#define SIM_SDID_ADDR32                     ((uint32)(SIM_BASEADDR + (uint32)0x00000024U))
/* SIM_PLATCGC - Platform Clock Gating Control Register */
#define SIM_PLATCGC_ADDR32                  ((uint32)(SIM_BASEADDR + (uint32)0x00000040U))
/* SIM_FCFG1 - Flash Configuration Register 1 */
#define SIM_FCFG1_ADDR32                    ((uint32)(SIM_BASEADDR + (uint32)0x0000004CU))
/* SIM_FCFG2 - Flash Configuration Register 2 */
#define SIM_FCFG2_ADDR32                    ((uint32)(SIM_BASEADDR + (uint32)0x00000050U))
/* SIM_UIDH - Unique Identification Register High */
#define SIM_UIDH_ADDR32                     ((uint32)(SIM_BASEADDR + (uint32)0x00000054U))
/* SIM_UIDMH - Unique Identification Register Mid-High */
#define SIM_UIDMH_ADDR32                    ((uint32)(SIM_BASEADDR + (uint32)0x00000058U))
/* SIM_UIDML - Unique Identification Register Mid Low */
#define SIM_UIDML_ADDR32                    ((uint32)(SIM_BASEADDR + (uint32)0x0000005CU))
/* SIM_UIDL - Unique Identification Register Low */
#define SIM_UIDL_ADDR32                     ((uint32)(SIM_BASEADDR + (uint32)0x00000060U))
/* SIM_CLKDIV4 - System Clock Divider Register 4 */
#define SIM_CLKDIV4_ADDR32                  ((uint32)(SIM_BASEADDR + (uint32)0x00000068U))
/* SIM_MISCTRL1 - Miscellaneous Control register 1 */
#define SIM_MISCTRL1_ADDR32                 ((uint32)(SIM_BASEADDR + (uint32)0x0000006CU))

