DDDSZY/S32K1X_MCAL_DEMO/S32K148_MCAL_DEMO/MCAL/Mcu_TS_T40D2M10I6R0/include/Reg_eSys_SIM.h
/****************************************************/
/***              SIM_CHIPCTL                     ***/
/****************************************************/
#define SIM_CHIPCTL_RWBITS_MASK32               ((uint32)0x003F3FFFU)

/* PDB_BB_SEL_1_2 bits only support on 14xW series of devices */
#ifdef MCU_SIM_CHIPCTL_PDB_BB_SEL_1_2_SUPPORT
    #define SIM_CHIPCTL_INIT_MASK32                 ((uint32)0x00CF200FU)
#else
    #define SIM_CHIPCTL_INIT_MASK32                 ((uint32)0x000F200FU)
#endif

#ifdef SIM_CHIPCTL_TRACECLK_SUPPORT
    #define SIM_CHIPCTL_CLOCK_MASK32                ((uint32)0x00001FF0U)
#else
    #define SIM_CHIPCTL_CLOCK_MASK32                ((uint32)0x00000FF0U)
#endif

#define SIM_CHIPCTL_SRAML_RETEN_MASK32          ((uint32)0x00200000U)
#define SIM_CHIPCTL_SRAMU_RETEN_MASK32          ((uint32)0x00100000U)
#define SIM_CHIPCTL_ADC_SUPPLYEN_MASK32         ((uint32)0x00080000U)
#define SIM_CHIPCTL_ADC_SUPPLY_MASK32           ((uint32)0x00070000U)
#define SIM_CHIPCTL_PDB_BB_SEL_MASK32           ((uint32)0x00002000U)
#define SIM_CHIPCTL_PDB_BB_SEL1_MASK32          ((uint32)0x00400000U)
#define SIM_CHIPCTL_PDB_BB_SEL2_MASK32          ((uint32)0x00800000U)

#ifdef SIM_CHIPCTL_TRACECLK_SUPPORT
    #define SIM_CHIPCTL_TRACECLK_SEL_MASK32     ((uint32)0x00001000U)
#endif

#define SIM_CHIPCTL_CLKOUTEN_MASK32             ((uint32)0x00000800U)
#define SIM_CHIPCTL_CLKOUTDIV_MASK32            ((uint32)0x00000700U)
#define SIM_CHIPCTL_CLKOUTDIV_SHIFT32           ((uint32)8U)
#define SIM_CHIPCTL_CLKOUTSEL_MASK32            ((uint32)0x000000F0U)
#define SIM_CHIPCTL_ADC_INTERLEAVE_SEL_MASK32   ((uint32)0x0000000FU)

#define SIM_CHIPCTL_SRAML_CONTENT_RETAINED_U32  ((uint32)0x00000000U)
#define SIM_CHIPCTL_NO_SRAML_RETENTION_U32      (SIM_CHIPCTL_SRAML_RETEN_MASK32)

#define SIM_CHIPCTL_SRAMU_CONTENT_RETAINED_U32  ((uint32)0x00000000U)
#define SIM_CHIPCTL_NO_SRAMU_RETENTION_U32      (SIM_CHIPCTL_SRAMU_RETEN_MASK32)

#define SIM_CHIPCTL_DISABLE_ADC_SUPPLY_MON_U32  ((uint32)0x00000000U)
#define SIM_CHIPCTL_ENABLE_ADC_SUPPLY_MON_U32   (SIM_CHIPCTL_ADC_SUPPLYEN_MASK32)

#define SIM_CHIPCTL_ADC_SUPPLY_VDD_U32          ((uint32)0x00000000U)
#define SIM_CHIPCTL_ADC_SUPPLY_VDDA_U32         ((uint32)0x00010000U)
#define SIM_CHIPCTL_ADC_SUPPLY_VREFH_U32        ((uint32)0x00020000U)
#define SIM_CHIPCTL_ADC_SUPPLY_VDD_3V_U32       ((uint32)0x00030000U)
#define SIM_CHIPCTL_ADC_SUPPLY_VDD_FLASH_3V_U32 ((uint32)0x00040000U)
#define SIM_CHIPCTL_ADC_SUPPLY_VDD_LV_U32       ((uint32)0x00050000U)

#ifdef SIM_CHIPCTL_TRACECLK_SUPPORT
    #define SIM_CHIPCTL_TRACECLK_CORE_CLK_U32       ((uint32)0x00000000U)
    #define SIM_CHIPCTL_TRACECLK_RES_U32            (SIM_CHIPCTL_TRACECLK_SEL_MASK32)
#endif

#define SIM_CHIPCTL_CLKOUT_DISABLE_U32          ((uint32)0x00000000U)
#define SIM_CHIPCTL_CLKOUT_ENABLE_U32           (SIM_CHIPCTL_CLKOUTEN_MASK32)

/** @violates @ref Reg_eSys_SIM_h_REF_2 MISRA 2004 Advisory Rule 19.7, Function-like macros are used for register operations to improve readability.*/
#define SIM_CHIPCTL_CLKOUTDIV_U32(value)   ((uint32)((uint32)((uint32)(value) << SIM_CHIPCTL_CLKOUTDIV_SHIFT32) & SIM_CHIPCTL_CLKOUTDIV_MASK32))

/** @violates @ref Reg_eSys_SIM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define SIM_CHIPCTL_CLKOUTSEL_SCG_CLKOUT_U32            ((uint32)0x00000000U)
/** @violates @ref Reg_eSys_SIM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define SIM_CHIPCTL_CLKOUTSEL_SOSC_DIV2_U32             ((uint32)0x00000020U)
/** @violates @ref Reg_eSys_SIM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define SIM_CHIPCTL_CLKOUTSEL_SIRC_DIV2_U32             ((uint32)0x00000040U)
/** @violates @ref Reg_eSys_SIM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define SIM_CHIPCTL_CLKOUTSEL_QSPI_SFIF_CLK_HYP_U32     ((uint32)0x00000050U)
/** @violates @ref Reg_eSys_SIM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define SIM_CHIPCTL_CLKOUTSEL_FIRC_DIV2_U32             ((uint32)0x00000060U)
/** @violates @ref Reg_eSys_SIM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define SIM_CHIPCTL_CLKOUTSEL_HCLK_U32                  ((uint32)0x00000070U)
/** @violates @ref Reg_eSys_SIM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define SIM_CHIPCTL_CLKOUTSEL_SPLL_DIV2_U32             ((uint32)0x00000080U)
/** @violates @ref Reg_eSys_SIM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define SIM_CHIPCTL_CLKOUTSEL_BUS_CLK_U32               ((uint32)0x00000090U)
/** @violates @ref Reg_eSys_SIM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define SIM_CHIPCTL_CLKOUTSEL_LPO_CLK_128K_U32          ((uint32)0x000000A0U)
/** @violates @ref Reg_eSys_SIM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define SIM_CHIPCTL_CLKOUTSEL_QSPI_IPG_CLK_U32          ((uint32)0x000000B0U)
/** @violates @ref Reg_eSys_SIM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define SIM_CHIPCTL_CLKOUTSEL_LPO_CLK_U32               ((uint32)0x000000C0U)
/** @violates @ref Reg_eSys_SIM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define SIM_CHIPCTL_CLKOUTSEL_QSPI_IPG_CLK_SFIF_U32     ((uint32)0x000000D0U)
/** @violates @ref Reg_eSys_SIM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define SIM_CHIPCTL_CLKOUTSEL_RTC_CLK_U32               ((uint32)0x000000E0U)
/** @violates @ref Reg_eSys_SIM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define SIM_CHIPCTL_CLKOUTSEL_QSPI_IPG_CLK_2XSFIF_U32   (SIM_CHIPCTL_CLKOUTSEL_MASK32)

#define SIM_CHIPCTL_NO_INTERLEAVE_CHANNEL_U32   ((uint32)0x00000000U)
#define SIM_PTB14_TO_ADC1_SE9_AND_ADC0_SE9_U32  ((uint32)0x00000008U)
#define SIM_PTB13_TO_ADC1_SE8_AND_ADC0_SE8_U32  ((uint32)0x00000004U)
#define SIM_PTB1_TO_ADC0_SE4_AND_ADC1_SE15_U32  ((uint32)0x00000002U)
#define SIM_PTB0_TO_ADC0_SE4_AND_ADC1_SE14_U32  ((uint32)0x00000001U)


/****************************************************/
/***              SIM_FTMOPT0                     ***/
/****************************************************/
#define SIM_FTMOPT0_RWBITS_MASK32           ((uint32)0xFFFF7777U)

