DDDSZY/S32K1X_MCAL_DEMO/S32K148_MCAL_DEMO/MCAL/Mcu_TS_T40D2M10I6R0/include/Reg_eSys_SIM.h
/****************************************************/
/***              SIM_FTMOPT1                     ***/
/****************************************************/
#define SIM_FTMOPT1_RWBITS_MASK32           ((uint32)0xFFFFF9FFU)

#define SIM_FTMOPT1_FTM3OUTSEL_MASK32       ((uint32)0xFF000000U)
#define SIM_FTMOPT1_FTM3OUTSEL_SHIFT32      ((uint32)24U)
#define SIM_FTMOPT1_FTM0OUTSEL_MASK32       ((uint32)0x00FF0000U)
#define SIM_FTMOPT1_FTM0OUTSEL_SHIFT32      ((uint32)16U)
#define SIM_FTMOPT1_FTMGLDOK_MASK32         ((uint32)0x00008000U)
#define SIM_FTMOPT1_FTM7SYNCBIT_MASK32      ((uint32)0x00004000U)
#define SIM_FTMOPT1_FTM6SYNCBIT_MASK32      ((uint32)0x00002000U)
#define SIM_FTMOPT1_FTM5SYNCBIT_MASK32      ((uint32)0x00001000U)
#define SIM_FTMOPT1_FTM4SYNCBIT_MASK32      ((uint32)0x00000800U)
#define SIM_FTMOPT1_FTM2CH1SEL_MASK32       ((uint32)0x00000100U)
#define SIM_FTMOPT1_FTM2CH0SEL_MASK32       ((uint32)0x000000C0U)
#define SIM_FTMOPT1_FTM1CH0SEL_MASK32       ((uint32)0x00000030U)
#define SIM_FTMOPT1_FTM3SYNCBIT_MASK32      ((uint32)0x00000008U)
#define SIM_FTMOPT1_FTM2SYNCBIT_MASK32      ((uint32)0x00000004U)
#define SIM_FTMOPT1_FTM1SYNCBIT_MASK32      ((uint32)0x00000002U)
#define SIM_FTMOPT1_FTM0SYNCBIT_MASK32      ((uint32)0x00000001U)

#define SIM_MODULATION_WITH_FTMX_CH0_U32    ((uint32)0x00000001U)
#define SIM_MODULATION_WITH_FTMX_CH1_U32    ((uint32)0x00000002U)
#define SIM_MODULATION_WITH_FTMX_CH2_U32    ((uint32)0x00000004U)
#define SIM_MODULATION_WITH_FTMX_CH3_U32    ((uint32)0x00000008U)
#define SIM_MODULATION_WITH_FTMX_CH4_U32    ((uint32)0x00000010U)
#define SIM_MODULATION_WITH_FTMX_CH5_U32    ((uint32)0x00000020U)
#define SIM_MODULATION_WITH_FTMX_CH6_U32    ((uint32)0x00000040U)
#define SIM_MODULATION_WITH_FTMX_CH7_U32    ((uint32)0x00000080U)

#define SIM_NO_MODULATION_FOR_FTMX_CH_U32   ((uint32)0x00000000U)

#define SIM_FTM_GLOBAL_LOAD_DISABLED_U32    ((uint32)0x00000000U)
#define SIM_FTM_GLOBAL_LOAD_ENABLED_U32     (SIM_FTMOPT1_FTMGLDOK_MASK32)

/** @violates @ref Reg_eSys_SIM_h_REF_2 MISRA 2004 Advisory Rule 19.7, Function-like macros are used for register operations to improve readability.*/
#define SIM_FTMOPT1_FTM3OUTSEL_U32(value)   ((uint32)((uint32)((uint32)(value) << SIM_FTMOPT1_FTM3OUTSEL_SHIFT32) & SIM_FTMOPT1_FTM3OUTSEL_MASK32))

/** @violates @ref Reg_eSys_SIM_h_REF_2 MISRA 2004 Advisory Rule 19.7, Function-like macros are used for register operations to improve readability.*/
#define SIM_FTMOPT1_FTM0OUTSEL_U32(value)   ((uint32)((uint32)((uint32)(value) << SIM_FTMOPT1_FTM0OUTSEL_SHIFT32) & SIM_FTMOPT1_FTM0OUTSEL_MASK32))

#define SIM_FTM2CH1SEL_FTM2_CH1_U32         ((uint32)0x00000000U)
#define SIM_FTM2CH1SEL_XOR_U32              (SIM_FTMOPT1_FTM2CH1SEL_MASK32)

#define SIM_FTM2CH0SEL_FTM2_CH0_INPUT_U32   ((uint32)0x00000000U)
#define SIM_FTM2CH0SEL_CMP0_OUTPUT_U32      ((uint32)0x00000040U)

#define SIM_FTM1CH0SEL_FTM1_CH0_INPUT_U32   ((uint32)0x00000000U)
#define SIM_FTM1CH0SEL_CMP0_OUTPUT_U32      ((uint32)0x00000010U)

/****************************************************/
/***              SIM_MISCTRL0                    ***/
/****************************************************/
#define SIM_MISCTRL0_RWBITS_MASK32          ((uint32)0x07FF4000U)

#define SIM_QSPI_CLK_REFERENCE_EN_U32       ((uint32)0x04000000U)
#define SIM_QSPI_CLK_REFERENCE_DIS_U32      ((uint32)0x00000000U)

#define SIM_RMII_CLK_SEL_SOSCDIV1_DIS_U32   ((uint32)0x00000000U)
#define SIM_RMII_CLK_SEL_SOSCDIV1_EN_U32    ((uint32)0x02000000U)

#define SIM_RMII_CLK_OBE_EN_U32             ((uint32)0x01000000U)
#define SIM_RMII_CLK_OBE_DIS_U32            ((uint32)0x00000000U)

#define SIM_MISCTRL0_FTM7_OBE_CTRL_MASK32   ((uint32)0x00800000U)
#define SIM_MISCTRL0_FTM6_OBE_CTRL_MASK32   ((uint32)0x00400000U)
#define SIM_MISCTRL0_FTM5_OBE_CTRL_MASK32   ((uint32)0x00200000U)
#define SIM_MISCTRL0_FTM4_OBE_CTRL_MASK32   ((uint32)0x00100000U)
#define SIM_MISCTRL0_FTM3_OBE_CTRL_MASK32   ((uint32)0x00080000U)
#define SIM_MISCTRL0_FTM2_OBE_CTRL_MASK32   ((uint32)0x00040000U)
#define SIM_MISCTRL0_FTM1_OBE_CTRL_MASK32   ((uint32)0x00020000U)
#define SIM_MISCTRL0_FTM0_OBE_CTRL_MASK32   ((uint32)0x00010000U)

#define SIM_FTM7_OUTPUT_SAFE_STATE_U32      ((uint32)0x00000000U)
#define SIM_FTM7_OUTPUT_TRISTATE_U32        (SIM_MISCTRL0_FTM7_OBE_CTRL_MASK32)

#define SIM_FTM6_OUTPUT_SAFE_STATE_U32      ((uint32)0x00000000U)
#define SIM_FTM6_OUTPUT_TRISTATE_U32        (SIM_MISCTRL0_FTM6_OBE_CTRL_MASK32)

#define SIM_FTM5_OUTPUT_SAFE_STATE_U32      ((uint32)0x00000000U)
#define SIM_FTM5_OUTPUT_TRISTATE_U32        (SIM_MISCTRL0_FTM5_OBE_CTRL_MASK32)

#define SIM_FTM4_OUTPUT_SAFE_STATE_U32      ((uint32)0x00000000U)
#define SIM_FTM4_OUTPUT_TRISTATE_U32        (SIM_MISCTRL0_FTM4_OBE_CTRL_MASK32)

#define SIM_FTM3_OUTPUT_SAFE_STATE_U32      ((uint32)0x00000000U)
#define SIM_FTM3_OUTPUT_TRISTATE_U32        (SIM_MISCTRL0_FTM3_OBE_CTRL_MASK32)

#define SIM_FTM2_OUTPUT_SAFE_STATE_U32      ((uint32)0x00000000U)
#define SIM_FTM2_OUTPUT_TRISTATE_U32        (SIM_MISCTRL0_FTM2_OBE_CTRL_MASK32)

#define SIM_FTM1_OUTPUT_SAFE_STATE_U32      ((uint32)0x00000000U)
#define SIM_FTM1_OUTPUT_TRISTATE_U32        (SIM_MISCTRL0_FTM1_OBE_CTRL_MASK32)

#define SIM_FTM0_OUTPUT_SAFE_STATE_U32      ((uint32)0x00000000U)
#define SIM_FTM0_OUTPUT_TRISTATE_U32        (SIM_MISCTRL0_FTM0_OBE_CTRL_MASK32)

#define SIM_FTM_GTB_SPLIT_EN_U32            ((uint32)0x00004000U)
#define SIM_FTM_GTB_SPLIT_DIS_U32           ((uint32)0x00000000U)

/****************************************************/
/***              SIM_PLATGC                      ***/
/****************************************************/
#ifdef MCU_PLATGC_GPIO_CLK_SUPPORT
    #if (MCU_PLATGC_GPIO_CLK_SUPPORT == STD_OFF)
        #define SIM_PLATGC_RWBITS_MASK32            ((uint32)0x0000001FU)
    #else
        #define SIM_PLATGC_RWBITS_MASK32            ((uint32)0x0000003FU)
    #endif
#else
    #define SIM_PLATGC_RWBITS_MASK32            ((uint32)0x0000001FU)
#endif
    
    

#define SIM_PLATGC_CGCGPIO_MASK32           ((uint32)0x00000020U)
#define SIM_PLATGC_CGCEIM_MASK32            ((uint32)0x00000010U)
#define SIM_PLATGC_CGCERM_MASK32            ((uint32)0x00000008U)
#define SIM_PLATGC_CGCDMA_MASK32            ((uint32)0x00000004U)
#define SIM_PLATGC_CGCMPU_MASK32            ((uint32)0x00000002U)
#define SIM_PLATGC_CGCMSCM_MASK32           ((uint32)0x00000001U)

