DDDSZY/S32K1X_MCAL_DEMO/S32K148_MCAL_DEMO/MCAL/Mcu_TS_T40D2M10I6R0/include/Reg_eSys_SIM.h
#define SIM_PLATGC_EIM_CLK_ENABLE_U32       (SIM_PLATGC_CGCEIM_MASK32)
#define SIM_PLATGC_EIM_CLK_DISABLE_U32      ((uint32)0x00000000U)

#define SIM_PLATGC_ERM_CLK_ENABLE_U32       (SIM_PLATGC_CGCERM_MASK32)
#define SIM_PLATGC_ERM_CLK_DISABLE_U32      ((uint32)0x00000000U)

#define SIM_PLATGC_DMA_CLK_ENABLE_U32       (SIM_PLATGC_CGCDMA_MASK32)
#define SIM_PLATGC_DMA_CLK_DISABLE_U32      ((uint32)0x00000000U)

#define SIM_PLATGC_MPU_CLK_ENABLE_U32       (SIM_PLATGC_CGCMPU_MASK32)
#define SIM_PLATGC_MPU_CLK_DISABLE_U32      ((uint32)0x00000000U)

#define SIM_PLATGC_MSCM_CLK_ENABLE_U32      (SIM_PLATGC_CGCMSCM_MASK32)
#define SIM_PLATGC_MSCM_CLK_DISABLE_U32     ((uint32)0x00000000U)

#define SIM_PLATGC_GPIO_CLK_ENABLE_U32      (SIM_PLATGC_CGCGPIO_MASK32)
#define SIM_PLATGC_GPIO_CLK_DISABLE_U32     ((uint32)0x00000000U)

/****************************************************/
/***              SIM_CLKDIV4                     ***/
/****************************************************/
#define SIM_CLKDIV4_RWBITS_MASK32               ((uint32)0x1000000FU)

#define SIM_CLKDIV4_TRACEDIVEN_MASK32           ((uint32)0x10000000U)
#define SIM_CLKDIV4_TRACEDIV_MASK32             ((uint32)0x0000000EU)
#define SIM_CLKDIV4_TRACEDIV_SHIFT32            ((uint32)1U)
#define SIM_CLKDIV4_TRACEFRAC_MASK32            ((uint32)0x00000001U)

#define SIM_DEBUG_TRACE_DIVIDER_DISABLED_U32    ((uint32)0x00000000U)
#define SIM_DEBUG_TRACE_DIVIDER_ENABLED_U32     (SIM_CLKDIV4_TRACEDIVEN_MASK32)

#define SIM_CLKDIV4_TRACEFRAC_0_U32            ((uint32)0x00000000U)
#define SIM_CLKDIV4_TRACEFRAC_1_U32            (SIM_CLKDIV4_TRACEFRAC_MASK32)

/** @violates @ref Reg_eSys_SIM_h_REF_2 MISRA 2004 Advisory Rule 19.7, Function-like macros are used for register operations to improve readability.*/
#define SIM_CLKDIV4_TRACEDIV_U32(value)         ((uint32)((uint32)((value) << SIM_CLKDIV4_TRACEDIV_SHIFT32) & SIM_CLKDIV4_TRACEDIV_MASK32))


/****************************************************/
/***              SIM_MISCTRL1                    ***/
/****************************************************/
#define SIM_MISCTRL1_RWBITS_MASK32              ((uint32)0x00000001U)

#define SIM_MISCTRL1_SW_TRG_MASK32              ((uint32)0x00000001U)

/*==================================================================================================
*                                             ENUMS
==================================================================================================*/


/*==================================================================================================
*                                STRUCTURES AND OTHER TYPEDEFS
==================================================================================================*/


/*==================================================================================================
*                                GLOBAL VARIABLE DECLARATIONS
==================================================================================================*/


/*==================================================================================================
*                                    FUNCTION PROTOTYPES
==================================================================================================*/



#ifdef __cplusplus
}
#endif

#endif /* REG_ESYS_SIM_H */

/** @} */
